app/Http/Controllers/CourseController.php

    public function index()
    {
        $courses = Course::query()->orderBy('created_at', 'DESC')->paginate(PAGINATE_COUNT);
---
select * from `courses` order by `created_at` desc limit 50 offset 0
select count(*) as aggregate from `courses`