app/Http/Controllers/HomeController.php

select * from `courses` order by `created_at` desc limit 50 offset 0
select count(*) as aggregate from `courses`
---
    public function index()
    {
        $courses = Cache::remember("courses", 600, function () {
            return Course::query()->orderBy('created_at', 'DESC')->paginate(PAGINATE_COUNT);