app/Http/Controllers/LessonController.php

select * from `lessons` order by `created_at` desc limit 50 offset 0
select count(*) as aggregate from `lessons`
---
    public function index()
    {
        $data['lessons'] = Lesson::orderBy('created_at', 'DESC')->paginate(PAGINATE_COUNT);